<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\Models\Article;
use App\Models\Category;
use App\Models\JobPost;
use App\Models\User;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        Article::factory()->count(9)->create();
        JobPost::factory()->count(6)->create();
        Category::factory()->count(5)->create();
        User::factory()->create([
            'name' => 'Zaw Lin Htet',
            'email' => 'zawlinhtet@gmail.com',
            'password' => bcrypt('password'),
        ]);
        User::factory()->count(25)->create();
        
        Article::factory()->create([
            'title' => 'လူမွဲခံယူခြင်းဆိုင်ရာ ကျွမ်းကျင်သူများကြီးကြပ်ရေးကောင်စီ ၁/၂၀၂၀ အစည်းအဝေးကျင်းပခြင်း',

            'body' => 'ပြည်ထောင်စုအစိုးရအဖွဲ့၏ ၂၀၂၀ ပြည့်နှစ်၊ မတ်လ ၂၆ ရက်နေ့၊ အမိန့်ကြော်ငြာစာ အမှတ် ၂၅/၂၀၂၀ ဖြင့် ဖွဲ့စည်းခဲ့သော လူမွဲခံယူခြင်းဆိုင်ရာကျွမ်းကျင်သူများ ကြီးကြပ်ရေးကောင်စီ (၁/၂၀၂၀) အစည်းအဝေးကို ပြည်ထောင်စုစာရင်းစစ်ချုပ်ရုံး ရန်ကုန်သင်တန်း ကျောင်း၌ ၂၇-၆-၂၀၂၀ ရက်နေ့ နံနက် ၁၀ နာရီတွင် ကျင်းပခဲ့ပါသည်။
            အစည်းအဝေးတွင် ကောင်စီ၏လုပ်ငန်းတာဝန်များကို ထိရောက်စွာဆောင်ရွက်နိုင်ရန် လူမွဲခံယူခြင်းဆိုင်ရာဥပဒေအရ ကျွမ်းကျင်သူများမှတ်ပုံတင်လက်မှတ် ထုတ်ပေးရေးကော်မတီ၊ ကျွမ်းကျင်သူများစည်းကမ်းထိန်းသိမ်းရေးကော်မတီ၊ အကြံပေးကော်မတီ သို့မဟုတ် အမှုဆောင်ကော်မတီနှင့်ရုံးအဖွဲ့ ဖွဲ့စည်းရန်၊ ကြီးကြပ်ရေးအဖွဲ့ ဖွဲ့စည်းရာတွင် ဥပဒေပိုင်းဆိုင်ရာကိစ္စရပ်များအတွက် တရားလွှတ်တော်ရှေိ့နေများ၊ ငွေရေးကြေးရေး ကိစ္စအတွက် စာရင်းပညာရှင်များ၊ လုပ်ငန်းပိုင်းဆိုင်ရာအတွက် စီးပွားရေးပညာရှင်များ ပါဝင်ဖွဲ့စည်းရန်၊ လူမွဲခံယူခြင်းဆိုင်ရာ ဥပဒေတွင် အပိုင်း(၁၁) ပိုင်းပါဝင်ပြီး လုပ်ဆောင်ရမည့် လုပ်ငန်းတာဝန်များသဖြင့် အားလုံးဝိုင်းဝန်းကူညီ ဆောင်ရွက်ပေးစေလိုကြောင်း ပြည်ထောင်စုစာရင်းစစ်ချုပ် ဦးမော်သန်းက ပြောကြားပြီး ပြည်ထောင်စုစာရင်းစစ်ချုပ်အား ကောင်စီဥက္ကဋ္ဌအဖြစ် ရွေးချယ်တင်မြှောက်၍ လူမွဲခံယူခြင်းဆိုင်ရာ ကျွမ်းကျင်သူများအသင်း ဖွဲ့စည်းထားမှုကိုအသိအမှတ်ပြုကာ လူမွဲခံယူခြင်းဆိုင်ရာ ကျွမ်းကျင်သူများကို မှတ်ပုံတင်လက်မှတ် ဆောလျှင်စွာထုတ်ပေးရေးကိစ္စများနှင့်စပ်လျဉ်း၍ ဆွေးနွေးခဲ့ကြပြီး ဦးစားပေး ဆောင်ရွက်သင့်သည့်ကိစ္စရပ်များကို အကြံပြုခဲ့ကြပါသည်။

            အစည်းအဝေးသို့ တရားလွှတ်တော်ရှေ့နေများကောင်စီဥက္ကဋ္ဌ၊ မြန်မာနိုင်ငံတော်ဗဟိုဘဏ်ဥက္ကဋ္ဌ၊ ပြည်ထောင်စုမြန်မာနိုင်ငံကုန်သည်များနှင့် စက်မှုလက်မှုလုပ်ငန်းရှင်များအသင်းချုပ်ဥက္ကဋ္ဌ၊ ငွေချေးသက်သေခံလက်မှတ်လုပ်ငန်းကြီးကြပ်ရေးကော်မရှင်အဖွဲ့ဝင်၊ မြန်မာနိုင်ငံလက်မှတ်ရပြည်သူ့စာရင်းကိုင်များအသင်းမှ နာယက၊ ဥက္ကဋ္ဌ၊ ဒုတိယဥက္ကဋ္ဌ နှင့် အဖွဲ့ဝင်များ၊ ရင်းနှီးမြုပ်နှံမှုနှင့် ကုမ္ပဏီများညွှန်ကြားမှုဦးစီးဌာနမှ ညွှန်ကြားရေးမှူးချုပ်တို့ တက်ရောက်ခဲ့ကြပါသည်။',

            'author' => 'ပြည်ထောင်စုစာရင်းစစ်ချုပ် ဦးမော်သန်း',
            'category_id' => 1,
        ]);
        // \App\Models\User::factory(10)->create();

        // \App\Models\User::factory()->create([
        //     'name' => 'Test User',
        //     'email' => 'test@example.com',
        // ]);
    }
}
